<a href="https://colab.research.google.com/github/adriano06-tech/kaggle_titanic_ML/blob/main/kaggle_titanic_ML_competition.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
SEED = 20

np.random.seed(SEED)

train_uri = 'https://raw.githubusercontent.com/adriano06-tech/kaggle_titanic_ML/main/data/train.csv'
train = pd.read_csv(train_uri)
train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [2]:
train.drop(columns = ['PassengerId', 'Name'], inplace = True)
train.head()

   Survived  Pclass     Sex   Age  ...            Ticket     Fare Cabin  Embarked
0         0       3    male  22.0  ...         A/5 21171   7.2500   NaN         S
1         1       1  female  38.0  ...          PC 17599  71.2833   C85         C
2         1       3  female  26.0  ...  STON/O2. 3101282   7.9250   NaN         S
3         1       1  female  35.0  ...            113803  53.1000  C123         S
4         0       3    male  35.0  ...            373450   8.0500   NaN         S

[5 rows x 10 columns]

In [3]:
train['Sex'] = train['Sex'].map({'male': 0, 'female': 1})
train.head()

   Survived  Pclass  Sex   Age  ...            Ticket     Fare Cabin  Embarked
0         0       3    0  22.0  ...         A/5 21171   7.2500   NaN         S
1         1       1    1  38.0  ...          PC 17599  71.2833   C85         C
2         1       3    1  26.0  ...  STON/O2. 3101282   7.9250   NaN         S
3         1       1    1  35.0  ...            113803  53.1000  C123         S
4         0       3    0  35.0  ...            373450   8.0500   NaN         S

[5 rows x 10 columns]

In [4]:
train['Cabin'] = train['Cabin'].fillna('NULL')
train.head()

   Survived  Pclass  Sex   Age  ...            Ticket     Fare Cabin  Embarked
0         0       3    0  22.0  ...         A/5 21171   7.2500  NULL         S
1         1       1    1  38.0  ...          PC 17599  71.2833   C85         C
2         1       3    1  26.0  ...  STON/O2. 3101282   7.9250  NULL         S
3         1       1    1  35.0  ...            113803  53.1000  C123         S
4         0       3    0  35.0  ...            373450   8.0500  NULL         S

[5 rows x 10 columns]

In [5]:
train['Age'] = train['Age'].fillna(train['Age'].median())
train.head()

   Survived  Pclass  Sex   Age  ...            Ticket     Fare Cabin  Embarked
0         0       3    0  22.0  ...         A/5 21171   7.2500  NULL         S
1         1       1    1  38.0  ...          PC 17599  71.2833   C85         C
2         1       3    1  26.0  ...  STON/O2. 3101282   7.9250  NULL         S
3         1       1    1  35.0  ...            113803  53.1000  C123         S
4         0       3    0  35.0  ...            373450   8.0500  NULL         S

[5 rows x 10 columns]

In [6]:
train_X = train[train.columns[1:]]
train_Y = np.array(train['Survived'])

print(f'X: {train_X.shape} ||| Y: {train_Y.shape}')

X: (891, 9) ||| Y: (891,)

In [7]:
ticket_remap = {}
ticket_i = 0
cabin_remap = {}
cabin_i = 0
embarked_remap = {}
embarked_i = 0

for index, row in train_X.iterrows():
    if row['Ticket'] not in ticket_remap:
        ticket_remap[row['Ticket']] = ticket_i
        ticket_i += 1
        
    if row['Cabin'] not in cabin_remap:
        cabin_remap[row['Cabin']] = cabin_i
        cabin_i += 1
    
    if row['Embarked'] not in embarked_remap:
        embarked_remap[row['Embarked']] = embarked_i
        embarked_i += 1
        

train_X['Ticket'] = train_X['Ticket'].map(ticket_remap)
train_X['Cabin'] = train_X['Cabin'].map(cabin_remap)
train_X['Embarked'] = train_X['Embarked'].map(embarked_remap)

train_X

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:22: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:23: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:24: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

     Pclass  Sex   Age  SibSp  Parch  Ticket     Fare  Cabin  Embarked
0         3    0  22.0      1      0       0   7.2500      0         0
1         1    1  38.0      1      0       1  71.2833      1         1
2         3    1  26.0      0      0       2   7.9250      0         0
3         1    1  35.0      1      0       3  53.1000      2         0
4         3    0  35.0      0      0       4   8.0500      0         0
..      ...  ...   ...    ...    ...     ...      ...    ...       ...
886       2    0  27.0      0      0     677  13.0000      0         0
887       1    1  19.0      0      0     678  30.0000    146         0
888       3    1  28.0      1      2     614  23.4500      0         0
889       1    0  26.0      0      0     679  30.0000    147         1
890       3    0  32.0      0      0     680   7.7500      0         2

[891 rows x 9 columns]

In [8]:
from sklearn.preprocessing import StandardScaler

train_X_columns_labels = train_X.columns

scaler = StandardScaler()

train_X = scaler.fit_transform(train_X)

train_X = pd.DataFrame(train_X)
train_X.columns = train_X_columns_labels
train_X.head()

     Pclass       Sex       Age  ...      Fare     Cabin  Embarked
0  0.827377 -0.737695 -0.565736  ... -0.502445 -0.443934 -0.568764
1 -1.566107  1.355574  0.663861  ...  0.786845 -0.415344  0.976263
2  0.827377  1.355574 -0.258337  ... -0.488854 -0.443934 -0.568764
3 -1.566107  1.355574  0.433312  ...  0.420730 -0.386754 -0.568764
4  0.827377 -0.737695  0.433312  ... -0.486337 -0.443934 -0.568764

[5 rows x 9 columns]

In [9]:
test_uri = 'https://raw.githubusercontent.com/adriano06-tech/kaggle_titanic_ML/main/data/test.csv'
test = pd.read_csv(test_uri)
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [10]:
gender_submission_uri = 'https://raw.githubusercontent.com/adriano06-tech/kaggle_titanic_ML/main/data/gender_submission.csv'
gender_submission = pd.read_csv(gender_submission_uri)
gender_submission.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [11]:
test_Y = []

for index, row in test.iterrows():
    select = gender_submission['PassengerId'] == row['PassengerId']
    survived = gender_submission[select].values[0][1]
    test_Y.append(survived)
    
test_Y = np.array(test_Y)
test_Y

array([0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 0, 0,
       1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1,
       1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1,
       1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0,
       0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1, 0,
       0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0,
       0, 1, 0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0,
       1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0])

In [12]:
test.drop(columns = ['PassengerId', 'Name'], inplace = True)
test.head()

   Pclass     Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0       3    male  34.5      0      0   330911   7.8292   NaN        Q
1       3  female  47.0      1      0   363272   7.0000   NaN        S
2       2    male  62.0      0      0   240276   9.6875   NaN        Q
3       3    male  27.0      0      0   315154   8.6625   NaN        S
4       3  female  22.0      1      1  3101298  12.2875   NaN        S

In [13]:
test['Sex'] = test['Sex'].map({'male': 0, 'female': 1})
test.head()

   Pclass  Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0       3    0  34.5      0      0   330911   7.8292   NaN        Q
1       3    1  47.0      1      0   363272   7.0000   NaN        S
2       2    0  62.0      0      0   240276   9.6875   NaN        Q
3       3    0  27.0      0      0   315154   8.6625   NaN        S
4       3    1  22.0      1      1  3101298  12.2875   NaN        S

In [14]:
test['Cabin'] = test['Cabin'].fillna('NULL')
test.head()

   Pclass  Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0       3    0  34.5      0      0   330911   7.8292  NULL        Q
1       3    1  47.0      1      0   363272   7.0000  NULL        S
2       2    0  62.0      0      0   240276   9.6875  NULL        Q
3       3    0  27.0      0      0   315154   8.6625  NULL        S
4       3    1  22.0      1      1  3101298  12.2875  NULL        S

In [15]:
test['Age'] = test['Age'].fillna(test['Age'].median())
test.head()

   Pclass  Sex   Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0       3    0  34.5      0      0   330911   7.8292  NULL        Q
1       3    1  47.0      1      0   363272   7.0000  NULL        S
2       2    0  62.0      0      0   240276   9.6875  NULL        Q
3       3    0  27.0      0      0   315154   8.6625  NULL        S
4       3    1  22.0      1      1  3101298  12.2875  NULL        S

In [16]:
test_X = test[test.columns[:]]

print(f'X: {test_X.shape} ||| Y: {test_Y.shape}')

X: (418, 9) ||| Y: (418,)

In [17]:
ticket_remap = {}
ticket_i = 0
cabin_remap = {}
cabin_i = 0
embarked_remap = {}
embarked_i = 0

for index, row in test_X.iterrows():
    if row['Ticket'] not in ticket_remap:
        ticket_remap[row['Ticket']] = ticket_i
        ticket_i += 1
        
    if row['Cabin'] not in cabin_remap:
        cabin_remap[row['Cabin']] = cabin_i
        cabin_i += 1
    
    if row['Embarked'] not in embarked_remap:
        embarked_remap[row['Embarked']] = embarked_i
        embarked_i += 1
        

test_X['Ticket'] = test_X['Ticket'].map(ticket_remap)
test_X['Cabin'] = test_X['Cabin'].map(cabin_remap)
test_X['Embarked'] = test_X['Embarked'].map(embarked_remap)

test_X

     Pclass  Sex   Age  SibSp  Parch  Ticket      Fare  Cabin  Embarked
0         3    0  34.5      0      0       0    7.8292      0         0
1         3    1  47.0      1      0       1    7.0000      0         1
2         2    0  62.0      0      0       2    9.6875      0         0
3         3    0  27.0      0      0       3    8.6625      0         1
4         3    1  22.0      1      1       4   12.2875      0         1
..      ...  ...   ...    ...    ...     ...       ...    ...       ...
413       3    0  27.0      0      0     358    8.0500      0         1
414       1    1  39.0      0      0     359  108.9000     76         2
415       3    0  38.5      0      0     360    7.2500      0         1
416       3    0  27.0      0      0     361    8.0500      0         1
417       3    0  27.0      1      1     362   22.3583      0         2

[418 rows x 9 columns]

In [18]:
from sklearn.preprocessing import StandardScaler

test_X_columns_labels = test_X.columns

scaler = StandardScaler()

test_X = scaler.fit_transform(test_X)

test_X = pd.DataFrame(test_X)

test_X.columns = test_X_columns_labels
test_X.head()

     Pclass       Sex       Age  ...      Fare     Cabin  Embarked
0  0.873482 -0.755929  0.386231  ... -0.497811 -0.434098 -1.955941
1  0.873482  1.322876  1.371370  ... -0.512660 -0.434098 -0.231082
2 -0.315819 -0.755929  2.553537  ... -0.464532 -0.434098 -1.955941
3  0.873482 -0.755929 -0.204852  ... -0.482888 -0.434098 -0.231082
4  0.873482  1.322876 -0.598908  ... -0.417971 -0.434098 -0.231082

[5 rows x 9 columns]

In [19]:
test_X = test_X.dropna()
test_X = np.array(test_X)

In [20]:
def calculate_accuracy(classifier):
    predict_labels = classifier.predict(test_X)
    
    
    accuracy_score = 0

    for i in range(len(predict_labels)):
        if(predict_labels[i] == test_Y[i]):
            accuracy_score += 1

    accuracy = accuracy_score / len(predict_labels) * 100
    
    return accuracy

In [21]:
from sklearn.svm import LinearSVC

classifier_linear_svc = LinearSVC()

classifier_linear_svc.fit(train_X, train_Y)

linear_svc_accuracy = calculate_accuracy(classifier_linear_svc)
print(f'The LinearSVC algorithm score was {round(linear_svc_accuracy, 2)}%')

The LinearSVC algorithm score was 66.67%

/usr/local/lib/python3.7/dist-packages/sklearn/svm/_base.py:947: ConvergenceWarning: Liblinear failed to converge, increase the number of iterations.
  "the number of iterations.", ConvergenceWarning)

In [22]:
from sklearn.ensemble import RandomForestClassifier

classifier_random_forest = RandomForestClassifier()

classifier_random_forest.fit(train_X, train_Y)

random_forest_accuracy = calculate_accuracy(classifier_random_forest)
print(f'The Random Forest Accuracy algorithm score was {round(random_forest_accuracy, 2)}%')

The Random Forest Accuracy algorithm score was 64.03%

In [23]:
from sklearn.svm import SVC

classifier_SVC = SVC()

classifier_SVC.fit(train_X, train_Y)

svc_accuracy = calculate_accuracy(classifier_SVC)
print(f'The SVC algorithm score was {round(svc_accuracy, 2)}%')

The SVC algorithm score was 64.75%